aws_vpc.vpc: Refreshing state... [id=vpc-0eb1fe89dc0576ef9]
data.aws_ami.linux2_ami: Reading...
aws_internet_gateway.igw: Refreshing state... [id=igw-02c1191b6fb0ec61f]
aws_subnet.db[1]: Refreshing state... [id=subnet-05ee11be15a53ff17]
aws_subnet.private[0]: Refreshing state... [id=subnet-03acb4036889acd9d]
aws_subnet.db[0]: Refreshing state... [id=subnet-0c1ee98f5bbcfcaa9]
aws_security_group.web_sg: Refreshing state... [id=sg-0ab4a43e9d264572f]
aws_route_table.public_rt: Refreshing state... [id=rtb-0be617f7d29c898fa]
aws_subnet.public[0]: Refreshing state... [id=subnet-0834e3471167e619c]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group]
aws_security_group.db_sg: Refreshing state... [id=sg-04c5a2138480b2548]
aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-0d77ddfa5ef11be5f]
aws_db_instance.rds: Refreshing state... [id=terraform-20220713164410976800000001]
data.aws_ami.linux2_ami: Read complete after 3s [id=ami-0bba0a4cb75835f71]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web_server[0] will be created
  + resource "aws_instance" "web_server" {
      + ami                                  = "ami-0bba0a4cb75835f71"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-03acb4036889acd9d"
      + tags                                 = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-server-0"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                             = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-server-0"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0ab4a43e9d264572f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.web_server[1] will be created
  + resource "aws_instance" "web_server" {
      + ami                                  = "ami-0bba0a4cb75835f71"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-server-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                             = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-server-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0ab4a43e9d264572f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }
    }

  # aws_route_table_association.public_rt_association[0] must be replaced
  # (moved from aws_route_table_association.public_rt_association)
-/+ resource "aws_route_table_association" "public_rt_association" {
      ~ id             = "rtbassoc-0d77ddfa5ef11be5f" -> (known after apply)
      ~ subnet_id      = "subnet-0834e3471167e619c" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_rt_association[1] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-0be617f7d29c898fa"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be updated in-place
  # (moved from aws_subnet.private)
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-03acb4036889acd9d"
      ~ tags                                           = {
          ~ "Name"        = "wordpress-private-subnet" -> "wordpress-private-subnet-0"
            # (3 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "wordpress-private-subnet" -> "wordpress-private-subnet-0"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-private-subnet-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                                       = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-private-subnet-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + vpc_id                                         = "vpc-0eb1fe89dc0576ef9"
    }

  # aws_subnet.public[0] must be replaced
  # (moved from aws_subnet.public)
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:825144470306:subnet/subnet-0834e3471167e619c" -> (known after apply)
      ~ availability_zone                              = "eu-west-1a" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az3" -> "euw1-az2" # forces replacement
      ~ id                                             = "subnet-0834e3471167e619c" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ map_public_ip_on_launch                        = false -> true
      ~ owner_id                                       = "825144470306" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "wordpress-public-subnet" -> "wordpress-public-subnet-0"
            # (3 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "wordpress-public-subnet" -> "wordpress-public-subnet-0"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.112.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-public-subnet-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                                       = {
          + "App"         = "wordpress"
          + "Name"        = "wordpress-public-subnet-1"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + vpc_id                                         = "vpc-0eb1fe89dc0576ef9"
    }

Plan: 7 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.